In [1]:
import pandas as pd
import pytest
# for connecting mysql database
from sqlalchemy import create_engine
# for connecting oracle database
import cx_Oracle
@pytest.fixture()
def connect_to_oracle_SRC():
    engine = create_engine("oracle+cx_oracle://System:admin@localhost:1521/xe")
    connection_oracle = engine.connect()
    yield connection_oracle
    connection_oracle.close()

In [2]:
def test_dataExtractionCheckInDatabase(connect_to_oracle_SRC):
    query_orcl_src = 'select DEPTNO,DNAME,LOC FROM dept_src'
    df_orcl_src = pd.read_sql(query_orcl_src,connect_to_oracle_SRC)
    expected_datatypes = {'deptno':'int64','dname':'object','loc':'object'}
    #expected_datatypes = {'DEPTNO': pd.Int64Dtype(), 'DNAME': 'object', 'LOC': 'object'}
#print(df_orcl_src.dtypes)
    assert df_orcl_src.dtypes.to_dict() == expected_datatypes," dataTypes not matching with expected"

In [6]:
from pymysql import connect
from sqlalchemy import create_engine
import pandas as pd
engine = create_engine('mysql+pymysql://root:Iphone9%40@localhost:3306/etlautomation')
connection = engine.connect()
query='select * from dept_tgt'
df = pd.read_sql(query,connection)

In [9]:
df

   deptno       dname              address
0      10  ACCOUNTING  ACCOUNTING,NEW YORK
1      20    RESEARCH      RESEARCH,DALLAS
2      30       SALES        SALES,CHICAGO
3      40  OPERATIONS    OPERATIONS,BOSTON
4      50          IT             IT,INDIA
5      60     FINANCE        FINANCE,INDIA